
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Объект.ВерсияФормата = Параметры.ВерсияФормата;
	Объект.РасширениеФормата = Параметры.РасширениеФормата;
	Объект.ВариантВыгрузки = Параметры.ВариантВыгрузки;
	
	ОбновитьПравилаВыгрузкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПравилВыгрузки

&НаКлиенте
Процедура ТаблицаПравилВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	Если Элементы.ТаблицаПравилВыгрузки.ТекущиеДанные <> Неопределено Тогда
	    ОповеститьОВыборе(Элементы.ТаблицаПравилВыгрузки.ТекущиеДанные.ПолноеИмяМетаданных);    
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПравилаВыгрузкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнениеПравилВыгрузки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект"); 
	
КонецПроцедуры

#КонецОбласти

 





