
Процедура Основной_ErpRetail_в_ЦБ_из_МагазиныОбработкаПолученияСообщения(Сообщение, Отказ)
	Коннектор_БиблиотекаФункций.ОбработкаВходящегоСообщения(Сообщение);
КонецПроцедуры

Процедура Основной_ErpRetail_в_Магазины_из_ЦБОбработкаПолученияСообщения(Сообщение, Отказ)
	Коннектор_БиблиотекаФункций.ОбработкаВходящегоСообщения(Сообщение);
КонецПроцедуры

Процедура Основной_ЗУПДО_В_ДО_из_ЗУПОбработкаПолученияСообщения(Сообщение, Отказ)
	// Вставить содержимое обработчика
	Коннектор_БиблиотекаФункций.ОбработкаВходящегоСообщения(Сообщение);
КонецПроцедуры

Процедура Основной_ЗУПДО_В_ЗУП_из_ДООбработкаПолученияСообщения(Сообщение, Отказ)
	// Вставить содержимое обработчика
	Коннектор_БиблиотекаФункций.ОбработкаВходящегоСообщения(Сообщение);
КонецПроцедуры

//Скопируйте строку ниже в процедуры-обработки получения сообщения после загрузки каналов приложения
//
//Коннектор_БиблиотекаФункций.ОбработкаВходящегоСообщения(Сообщение);
//