
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите описание", , "Наименование", "Объект");
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;    
	
	Записать();
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'xml'; en = 'xml'") + "(*.xml)|*.xml";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите правило конвертации";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда     
		
		Файл = Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);  
		Если Файл.Существует() Тогда
		
			Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла));
			СохранитьКомпонентуНаСервере(Адрес, Файл.Имя);
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Прочитать();
	
КонецПроцедуры  

&НаСервере
Процедура СохранитьКомпонентуНаСервере(Адрес, ИмяФайла)
	
	Если Адрес = Неопределено Тогда
		ДвоичныеДанные = Адрес;
	Иначе
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	ОбъектСпр = РеквизитФормыВЗначение("Объект");  
	
	ОбъектСпр.ХранилищеПравила = Новый ХранилищеЗначения(ДвоичныеДанные);  
	ОбъектСпр.ИмяФайла = ИмяФайла;    
	ОбъектСпр.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;      
	СохранитьКомпонентуНаСервере(Неопределено, "");   
	Прочитать();
	
КонецПроцедуры

