#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстВыражения", ТекстВыражения);
	Параметры.Свойство("ЭтоМассив", ЭтоМассив);
	
	ТекстЗаголовка = "Переменная контекста: ""Источник"". Возвращаемое значение ""Результат"", Тип - %1";
	
	Если ЭтоМассив Тогда
		Элементы.ТекстВыражения.Заголовок = СтрШаблон(ТекстЗаголовка, "Таблица значений");
	Иначе
		Элементы.ТекстВыражения.Заголовок = СтрШаблон(ТекстЗаголовка, "Произвольный");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура Записать(Команда)
	Закрыть(ТекстВыражения);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти