
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.РеквизитОбъекта Тогда
		ВыражениеНаВстроенномЯзыке = "";
	ИначеЕсли ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.ВыражениеНаВстроенномЯзыке Тогда
		РеквизитИС = "";
	ИначеЕсли ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.НеЗаполнять Тогда
		РеквизитИС = "";
		ВыражениеНаВстроенномЯзыке = "";
		ЭтоМассив = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Родитель.Пустая() Тогда
		ВариантПравилРодителя = Родитель.ВариантПравилЗаполненияСвойства;
		ВариантНеЗаполнять = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.НеЗаполнять;
		Если ВариантПравилРодителя <> ВариантНеЗаполнять Тогда
			Справочники.Коннектор_СвойстваКонструктора.ИзменитьПравилоСвойстваКонструктора(Родитель, ВариантНеЗаполнять);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти