
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьОбработкаЖР() Тогда
		
		ТекущаяДата = ТекущаяДата();
		
		Отбор = Новый Структура("СобытиеЖурналаРегистрации, ДатаНачала, ДатаОкончания");
			
		Отбор.ДатаНачала 	= НачалоДня(ТекущаяДата);
		Отбор.ДатаОкончания = КонецДня(ТекущаяДата);
		Отбор.СобытиеЖурналаРегистрации = "Коннектор";
			
		ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Отбор);
		
	Иначе	
		
		ПодключитьВнешнююОбработкуНаСервере();
    	ОткрытьФорму("ВнешняяОбработка.StandardEventLog.Форма");
		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция ЕстьОбработкаЖР()
	
	Возврат Метаданные.Обработки.Найти("ЖурналРегистрации") <> Неопределено;
	
КонецФункции 

&НаСервере
Процедура ПодключитьВнешнююОбработкуНаСервере()
	
    ВнешниеОбработки.Подключить("v8res://mngbase/StandardEventLog.epf", "StandardEventLog", false);  
	
КонецПроцедуры


