
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьДоступность();		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьДоступность()
	
	Элементы.ИсполняемыйКод.Видимость =
		Объект.ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.ВариантыВыгрузки.ИсполняемыйКод");	
				
КонецПроцедуры

#КонецОбласти